app/views/teams/show.html.erb

SELECT "players".* FROM "players" WHERE "players"."team_id" = $1  [["team_id", 53]]
---
  <tbody>
    <% @team.players.each do |player| %>