app/views/leagues/show.html.erb

	<div class="row">
		<% @league.teams.each do |team| %>
---
SELECT "teams".* FROM "teams" WHERE "teams"."league_id" = $1  [["league_id", 25]]

			<p><strong><%= team.title %></strong></p>
			<% team.players.each do |player| %>
---
SELECT "players".* FROM "players" WHERE "players"."team_id" = $1  [["team_id", 52]]