app/controllers/leagues_controller.rb

  def create

    @league = League.new(league_params)

    respond_to do |format|
      if @league.save
---
INSERT INTO "leagues" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Test League"], ["created_at", "2016-04-16 19:35:02.682706"], ["updated_at", "2016-04-16 19:35:02.682706"]]

  def destroy
    @league.destroy
---
DELETE FROM "leagues" WHERE "leagues"."id" = $1  [["id", 1]]

    def set_league
      @league = League.find(params[:id])
---
SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = $1 LIMIT 1  [["id", 27]]