app/controllers/users/omniauth_callbacks_controller.rb

    def facebook
        @user = UserProvider.find_for_facebook_oauth(request.env["omniauth.auth"])
---
SELECT  "user_providers".* FROM "user_providers" WHERE "user_providers"."provider" = $1 AND "user_providers"."uid" = $2  ORDER BY "user_providers"."id" ASC LIMIT 1  [["provider", "facebook"], ["uid", "10208289544218426"]]

    def google_oauth2
        @user = UserProvider.find_for_google_oauth(request.env["omniauth.auth"])
---
SELECT  "user_providers".* FROM "user_providers" WHERE "user_providers"."provider" = $1 AND "user_providers"."uid" = $2  ORDER BY "user_providers"."id" ASC LIMIT 1  [["provider", "google_oauth2"], ["uid", "107296353034509880136"]]